Repository: pathom111/RKSV
Catalog: lang/*/LC_MESSAGES/rktool.po
Languages: de

source: The number of receipts must be at least 1.
de: Die Anzahl der Rechnungen muss mindestens 1 sein.

source: No symmetric key present.
de: Kein symmetrischer Schlüssel vorhanden.

source: Invalid turnover counter size.
de: Umsatzzähler-Länge ungültig.

source: Malformed DEP
de: Ungültiges DEP

source: In group {}: {}.
de: In Gruppe {}: {}

source: Element "{}" missing
de: Element "{}" fehlt

source: Element "{}" malformed
de: Element "{}" ungültig

source: Element "{}" malformed: {}
de: Element "{}" ungültig: {}

source: Duplicate element "{}"
de: Element "{}" doppelt

source: Certificate "{}" malformed.
de: Zertifikat "{}" ungültig.

source: Duplicate DEP root
de: DEP-Wurzel doppelt

source: Malformed DEP root
de: Ungültige DEP-Wurzel

source: not a string
de: kein String

source: not a list
de: keine Liste

source: Receipt "{}"
de: Rechnung "{}"

source: No receipts found
de: Keine Rechnungen gefunden

source: Malformed JSON: {}.
de: Ungültiges JSON: {}.

source: Element "Signaturzertifikat" or "Zertifizierungsstellen" missing
de: Element "Signaturzertifikat" oder "Zertifizierungsstellen" fehlt

source: Malformed key store
de: Ungültiger Schlüsselspeicher

source: In certificate/public key "{}": {}.
de: Bei Zertifikat/öffentlichem Schlüssel "{}": {}.

source: Public key "{}" malformed.
de: Öffentlicher Schlüssel "{}" ungültig.

source: Malformed key store root
de: Ungültige Schlüsselspeicher-Wurzel.

source: not a dictionary
de: kein Verzeichnis

source: inner ID "{}" does not match outer ID "{}"
de: innere ID "{}" ist ungleich äußerer ID "{}"

source: invalid certificate ID "{}"
de: Ungültige Zertifikatsseriennummer "{}"

source: not one of "CERTIFICATE" or "PUBLIC_KEY"
de: nicht eines von "CERTIFICATE" oder "PUBLIC_KEY"

source: At receipt "{0}": {1}
de: Bei Rechnung "{0}": {1}

source: Malformed receipt
de: Ungültige Rechnung

source: Malformed receipt.
de: Ungültige Rechnung.

source: Unknown algorithm.
de: Unbekannter Algorithmus.

source: Algorithm mismatch.
de: Inkompatible Algorithmen.

source: Certificate serial invalid.
de: Zertifikat-Seriennummer ungültig.

source: Invalid certificate provider.
de: Ungültiger Zertifizierungsdiensteanbieter.

source: Unknown Receipt
de: Unbekannte Rechnung.

source: Receipt ID "{}" invalid.
de: Rechnungs-ID "{}" ungültig.

source: ZDA "{}" invalid.
de: ZDA "{}" ungültig.

source: Register ID "{}" invalid.
de: Kassen-ID "{}" ungültig.

source: Timestamp "{}" invalid.
de: Zeitstempel "{}" ungültig.

source: Sum tax normal "{}" invalid.
de: Betrag Satz normal "{}" ungültig.

source: Sum tax reduced 1 "{}" invalid.
de: Betrag Satz ermäßigt 1 "{}" ungültig.

source: Sum tax reduced 2 "{}" invalid.
de: Betrag Satz ermäßigt 2 "{}" ungültig.

source: Sum tax zero "{}" invalid.
de: Betrag Satz null "{}" ungültig.

source: Sum tax special "{}" invalid.
de: Betrag Satz besonders "{}" ungültig.

source: Encrypted turnover counter "{}" invalid.
de: Verschlüsselter Umsatzzähler "{}" ungültig.

source: Chaining value "{}" invalid.
de: Verkettungswert "{}" ungültig.

source: Certificate serial/Key ID "{}" invalid.
de: Zertifikat-Seriennummer/Schlüssel-ID "{}" ungültig.

source: Invalid JWS.
de: Ungültiges JWS.

source: JWS does not contain exactly three segments.
de: Das JWS beinhaltet nicht genau drei Segmente.

source: Base 64 padding was used in JWS.
de: Base 64 Padding wurde im JWS benutzt.

source: Invalid JWS header.
de: Ungültiger JWS Header.

source: Invalid JWS payload.
de: Ungültige JWS Payload.

source: JWS payload does not contain 12 elements.
de: Die JWS Payload beinhaltet nicht genau 12 Elemente.

source: Payload does not contain algorithm and ZDA IDs.
de: Die Payload beinhaltet keine Algorithmus- und ZDA-ID.

source: Algorithm ID "{}" invalid.
de: Algorithmus-ID "{}" ungültig.

source: You need to sign the receipt first.
de: Die Rechnung muss zuerst signiert werden.

source: Invalid machine-readable code.
de: Ungültiger maschinenlesbarer Code.

source: Machine-readable code does not contain 13 elements.
de: Der maschinenlesbare Code beinhaltet nicht genau 13 Elemente.

source: Machine-readable code does not contain algorithm and ZDA IDs.
de: Der maschinenlesbare Code beinhaltet keine Algorithmus- und ZDA-ID.

source: Signature "{}" not Base 64 encoded.
de: Signatur "{}" nicht Base 64 enkodiert.

source: Invalid OCR code.
de: Ungültiger OCR Code.

source: OCR code does not contain 13 elements.
de: Der OCR Code beinhaltet nicht genau 13 Elemente.

source: Encrypted turnover counter "{}" not Base 32 encoded.
de: Verschlüsselter Umsatzzähler "{}" nicht Base 32 enkodiert.

source: Chaining value "{}" not Base 32 encoded.
de: Verkettungswert "{}" nicht Base 32 enkodiert.

source: Signature "{}" not Base 32 encoded.
de: Signatur "{}" nicht Base 32 enkodiert.

source: Invalid CSV.
de: Ungültiges CSV.

source: JWS header "{}" invalid.
de: JWS header "{}" ungültig.

source: Signature "{}" invalid.
de: Signatur "{}" ungültig.

source: Signature "{}" uses padding.
de: Signatur "{}" benutzt Padding.

source: Signature "{}" not Base 64 URL encoded.
de: Signatur "{}" nicht Base 64 URL enkodiert.

source: Can't decrypt turnover counter, this is a dummy receipt.
de: Kann Umsatzzähler nicht entschlüsseln. Dies ist ein Trainingsbeleg.

source: Can't decrypt turnover counter, this is a reversal receipt.
de: Kann Umsatzzähler nicht entschlüsseln. Dies ist ein Stornobeleg.

source: Need key material for {} signature devices, got {} key pairs.
de: Brauche Schlüsselmaterial für {} Sicherheitseinrichtungen, habe {} Schlüsselpaare bekommen.

source: Selected algorithm not supported.
de: Gewählter Algorithmus wird nicht unterstützt.

source: no Exception
de: kein Fehler

source: Incremental and dict parser yield different results at chunksize {}.
de: Inkrementeller und Dictionary Parser liefern unterschiedliche Resultate bei einer Blockgröße von {}.

source: State update without verification failed.
de: Zustandsupdate ohne Verifikation fehlgeschlagen.

source: List of used receipt IDs invalid.
de: Liste verwendeter Rechnungs-IDs ist ungültig.

source: Expected {} in turnover counter but got {}.
de: Erwartete {} im Umsatzzähler, aber habe {} bekommen.

source: Expected "{}" but got "{}", message: "{}"
de: Erwartete "{}", aber habe "{}" bekommen, Nachricht: "{}"

source: Expected "{}" at receipt "{}" but it occured at "{}" instead
de: Erwartete "{}" bei Rechnung "{}", aber habe es stattdessen bei "{}" bekommen

source: Expected message "{}" but got "{}" instead
de: Erwartete Nachricht war "{}", habe stattdessen "{}" bekommen

source: Expected message matching "{}" but got "{}" instead
de: Erwartete Nachricht passend zu "{}", habe stattdessen "{}" bekommen

source: Result mismatch: without parsing {}:>{}<, with parsing {}:>{}<
de: Ergebnisse verschieden: ohne parsing {}:>{}<, mit parsing {}:>{}<

source: No run label
de: Kein Simulationsname

source: {} tests run, {} failed, {} errors
de: {} Tests ausgeführt, {} fehlgeschlagen, {} Fehler

source: Errors were found in the DEP.
de: DEP ist fehlerhaft.

source: Invalid key.
de: Ungültiger Schlüssel.

source: No cash register with index {}.
de: Keine Kassa mit Index {}.

source: The last cash register has no registered start receipt.
de: Die letzte Kassa hat keinen registrierten Startbeleg.

source: Malformed verification state
de: Ungültiger Überprüfungszustand

source: In cash register {}: {}.
de: Bei Kassa {}: {}.

source: Receipt ID "{0}" is already in use.
de: Rechnungs-ID "{0}" wird bereits verwendet.

source: backend type missing
de: Backend-Typ fehlt

source: backend data missing
de: Backend-Daten fehlen

source: backend type not a string
de: Backend-Typ ist kein String

source: unknown backend type
de: unbekannter Backend-Typ

source: backend data not a list
de: Backend-Daten sind keine Liste

source: receipt ID not a string
de: Belegnummer ist kein String

source: backend data not a dictionary
de: Backend-Daten sind kein Verzeichnis

source: minimum receipt ID missing
de: kleinste Belegnummer fehlt

source: maximum receipt ID missing
de: größte Belegnummer fehlt

source: minimum receipt ID not a string
de: kleinste Belegnummer ist kein String

source: maximum receipt ID not a string
de: größte Belegnummer ist kein String

source: not an integer
de: keine Ganzzahl

source: not a boolean
de: kein Boolean

source: Malformed verification state root
de: Ungültige Überprüfungszustand-Wurzel

source: not an object
de: kein Objekt

source: GGS Cluster is not supported in an open system.
de: GGS Verbund wird in offenen Systemen nicht unterstützt.

source: Chaining value "{0}" invalid.
de: Verkettungswert "{0}" ungültig.

source: Receipt after restored signature system must not have any turnover.
de: Rechnung nach Wiederherstellung der Sicherheitseinrichtung darf keinen Umsatz haben.

source: Turnover counter invalid.
de: Umsatzzähler ungültig.

source: Register ID changed.
de: Kassen-ID geändert.

source: Receipt was created before previous receipt.
de: Rechnung wurde vor vorhergehender Rechnung erstellt.

source: The system type changed.
de: Typ des Systems wurde geändert.

source: The size of the turnover counter changed.
de: Die Länge des Umsatzzählers wurde geändert.

source: No certificate specified in DEP and multiple groups used.
de: Kein Zertifikat angegeben, aber DEP hat mehrere Gruppen.

source: Certificate "%s" is not trusted.
de: Zertifikat "%s" wird nicht vertraut.

source: Certificate "{}" was not signed by "{}".
de: Zertifikat "{}" wurde nicht von "{}" signiert.

source: Two certificates with serial "{0}" detected (fingerprints "{1}" and "{2}"). This may be an attempted attack.
de: Zwei Zertifikate mit Seriennummer "{0}" gefunden (Fingerabdrücke "{1}" und "{2}"). Dies könnte ein versuchter Angriff sein.

source: Initial receipt not signed.
de: Startbeleg nicht signiert.

source: Initial receipt has nonzero turnover.
de: Startbeleg hat Umsatz ungleich Null.

source: Initial receipt has not been chained to the cash register ID.
de: Startbeleg ist nicht mit der Kassen-ID verkettet.

source: Initial receipt in cluster has not been chained to the previous cash register's initial receipt.
de: Startbeleg in Verbund ist nicht mit dem Startbeleg der vorherigen Kassa verkettet.

source: Initial receipt is a dummy or reversal receipt.
de: Startbeleg ist ein Trainings- oder Storno-Beleg.

source: THIS IS A BUG
de: DAS IST EIN BUG

source: Certificate serial mismatch.
de: Zertifikat-Seriennummern stimmen nicht überein.

source: No public key found.
de: Kein öffentlicher Schlüssel gefunden.

source: Invalid Signature.
de: Ungültige Signatur.

source: {} This is probably fine.
de: {} Das ist wahrscheinlich in Ordnung.

source: Signature System failed.
de: Sicherheitseinrichtung ausgefallen.

source: Invalid URL hash.
de: Ungültige URL Prüfsumme.

source: Null receipt not signed.
de: Nullbeleg nicht signiert.

source: Error
de: Fehler

source: Valid Signature
de: Gültige Signatur

source: No Signature
de: Keine Signatur

source: Signature system broken
de: Sicherheitseinrichtung ausgefallen

source: Cash Register ID
de: Kassen-ID

source: Receipt ID
de: Belegnummer

source: Timestamp
de: Datum & Uhrzeit

source: Sum Tax Normal
de: Betrag Satz Normal

source: Sum Tax Reduced 1
de: Betrag Satz Ermäßigt 1

source: Sum Tax Reduced 2
de: Betrag Satz Ermäßigt 2

source: Sum Tax Zero
de: Betrag Satz Null

source: Sum Tax Special
de: Betrag Satz Besonders

source: Turnover Counter
de: Umsatzzähler

source: Certificate Serial/Key ID
de: Zertifikat-Seriennummer/Schlüssel ID

source: Chaining Value
de: Verkettungswert

source: Signature
de: Signatur

source: Verifying...
de: Überprüfe...

source: Verify
de: Überprüfen

source: Load AES Key
de: AES Schlüssel laden

source: No AES key in crypto container
de: Kein AES Schlüssel in Schlüsselspeicher

source: No image taken.
de: Kein Bild aufgenommen.

source: Failed to compress image.
de: Fehler beim Komprimieren des Bildes.

source: No QR codes found.
de: Keine QR-Codes gefunden.

source: Load Receipt
de: Rechnung laden

source: Group %d
de: Gruppe %d

source: Serial:
de: Seriennummer:

source: Valid DEP
de: Gültiges DEP

source: Load DEP
de: DEP laden

source: Public Keys
de: Öffentliche Schlüssel

source: Certificates
de: Zertifikate

source: Key ID:
de: Schlüssel ID:

source: Load PEM Public Key
de: Öffentlichen Schlüssel (PEM) laden

source: Load PEM Certificate
de: Zertifikat (PEM) laden

source: Enter Public Key ID
de: ID des öffentlichen Schlüssels eingeben

source: Load Key Store
de: Schlüsselspeicher laden

source: Save Key Store
de: Schlüsselspeicher speichern

source: Malformed crypto container
de: Ungültiges Schlüsselmaterial

source: Input format must be one of %s.
de: Eingabeformat muss eines aus %s sein.

source: Output format must be one of %s.
de: Ausgabeformat muss eines aus %s sein.

source: Cancel
de: Abbrechen

source: Load
de: Laden

source: Save
de: Speichern

source: Receipt
de: Rechnung

source: Exit
de: Beenden

source: Decrypt Turnover Counter
de: Umsatzzähler entschlüsseln

source: JWS string
de: JWS-Zeichenkette

source: Read Receipt
de: Rechnung lesen

source: Import
de: Importieren

source: Export
de: Exportieren

source: Verify Receipt
de: Rechnung überprüfen

source: Verify DEP
de: DEP überprüfen

source: Key Store
de: Schlüsselspeicher

source: I need keys and certificates for %d signature devices.
de: Ich brauche Schlüssel und Zertifikate für %d Sicherheitseinrichtungen.

source: Turnover counter size needs to be between 5 and 16.
de: Umsatzzähler-Länge muss zwischen 5 und 16 sein.

source: Using seed "{}"
de: Verwende Seed "{}"

source: Used seed "{}"
de: Verwendete Seed "{}"

source: Start Receipt
de: Startbeleg

source: Last Receipt
de: Letzter Beleg

source: Last Turnover Counter
de: Letzter Umsatzzähler

source: Need Restore Receipt
de: Benötigt Nullbeleg

source: Cash Register {}:
de: Kassa {}:

source: Used Receipt IDs Backend
de: Benutzte Belegnummern Backend

source: Verification successful.
de: Überprüfung erfolgreich.

source: Line {: >3}: {}
de: Zeile {: >3}: {}

source: {} of {} receipts verified successfully.
de: {} von {} Rechnungen wurden erfolgreich überprüft.
